docs/res/schedule.org
#+title: Project Schedule
#+OPTIONS: p:t

* PROJ Schedule [1/4]

** TODO Development [1/4]


*** TODO Implement the input and output handling
DEADLINE: <2023-06-27 Tue>
- [ ] cli arguments (picocli)

*** TODO Physics simulation Itr 2
DEADLINE: <2023-07-11 Tue>

*** TODO Review Itr 2
DEADLINE: <2023-07-13 Thu>


** TODO Testing [0/3]

*** TODO Unit Testing
DEADLINE: <2023-07-09 Sun>
- [X] Identify functions for testing
- [ ] Develop boundary value tests
- [ ] Develop equivalence class tests
- [X] Develop decision table-based tests
- [ ] Develop path tests
- [ ] Develop data flow tests

*** TODO Integration Testing
DEADLINE: <2023-07-09 Sun>
- [ ] Identify subset of units for integration testing
- [ ] Develop and execute integration tests

*** TODO System Testing
DEADLINE: <2023-07-09 Sun>
- [X] Identify subset of use cases for system testing
- [ ] Develop and execute system tests


** TODO Docs & Submission [0/3]

*** TODO Documentation
DEADLINE: <2023-07-20 Thu>
- [X] Create README.md file
- [ ] Create TESTING.md file
- [ ] Ensure code is commented

*** TODO Review and Final Adjustments
DEADLINE: <2023-07-25 Tue>
- [ ] Review entire simulator and tests
- [ ] Make necessary adjustments

*** TODO Final Submission
DEADLINE: <2023-08-02 Wed>


* Completed

** DONE Set Up Development Environment
DEADLINE: <2023-05-23 Tue>
- [X] Install necessary software
- [X] Setup GitHub repository


** DONE Develop Initial Understanding
DEADLINE: <2023-06-02 Fri>
- [X] Understand the physics involved in the simulation
- [X] Research on best practices for implementing physics in Java
- [X] Research on best practices for java testing frameworks

*** DONE Problem Spec readme
DEADLINE: <2023-06-02 Fri>
**** DONE Objectives
**** DONE Functions
**** DONE Requirements


** DONE Design [0/0]

*** DONE Initial Design
DEADLINE: <2023-06-01 Thu>
- [X] Understand the problem domain
- [X] Research on Howitzers, their operation and factors affecting their projectiles
- [X] Understand the physics formulas provided and how they apply to the problem

*** DONE Define system specifications
DEADLINE: <2023-06-06 Tue>
- [X] Define the required inputs and expected outputs of the simulator
- [X] Identify key variables of the system: barrel pose, projectile radius and mass, drag coefficient, initial speed, force, and gravity
- [X] Discuss and agree on how these variables will be represented and manipulated in the simulator

*** DONE Design the software architecture
DEADLINE: <2023-06-11 Sun>
- [X] Identify key components/modules of the simulator
- [X] Establish interfaces and interactions between the components
- [X] Choose suitable data structures and algorithms for implementing the simulation
- [X] Sketch out a flowchart or UML diagram of the proposed system for visualization


** DONE Development
DEADLINE: <2023-06-18 Sun>
*** Misc
- [X] Set up action to run tests on github
- [X] Set up action to mirror repo to gitlab

- [X] Set up the basic structure of the simulator
- [X] Create the basic classes and functions as per the software architecture
- [X] Set up a basic UI if necessary, depending on plan to represent the simulator

*** DONE Physics simulation Itr 1
DEADLINE: <2023-06-27 Tue>
First iteration will include external force and drag in a unidirectional, time invariant vector space
- [X] Translate the physics formulas into Java code, options:
  - [X] hard coded kinematics
  - [X] parse equations to function
- [X] Implement the logic for simulating projectile movement
  - [X] external force applied
  - [X] drag force applied

*** DONE Review Itr 1
DEADLINE: <2023-06-27 Tue>
- [X] Ensure that all key variables incorporated into the simulation correctly
- [X] Ensure that errors in inputs handled gracefully
- [X] Align on path forward for next iteration

*** DONE Implement the input and output handling
DEADLINE: <2023-06-27 Tue>
- [X] Develop the logic for users to input the variables for the simulation
  - [X] json file parsing (gson)
- [X] Implement the logic for displaying the output of the simulation
  - Currently prints a tuple(x, y, z) coordinates of the projectile in the vector space
