docs/schedule.md

# Table of Contents

1.  [Schedule <code>[1/4]</code>](#org4305d17)
    1.  [Development <code>[1/4]</code>](#orgb3e8b29)
        1.  [Implement the input and output handling](#org1268ff7)
        2.  [Physics simulation Itr 2](#org83656a9)
        3.  [Review Itr 2](#orged1520f)
    2.  [Testing <code>[0/3]</code>](#orgaaf7960)
        1.  [Unit Testing](#org5d89666)
        2.  [Integration Testing](#org48157c9)
        3.  [System Testing](#org77e9b92)
    3.  [Docs & Submission <code>[0/3]</code>](#org27f99d7)
        1.  [Documentation](#orgfb0628f)
        2.  [Review and Final Adjustments](#orge01d5c3)
        3.  [Final Submission](#org8ff456d)
2.  [Completed](#orgbbd5ae0)
    1.  [Set Up Development Environment](#org11e0329)
    2.  [Develop Initial Understanding](#org45ae43d)
        1.  [Problem Spec readme](#org7b94f0c)
    3.  [Design <code>[0/0]</code>](#orgcb4a562)
        1.  [Initial Design](#org3783732)
        2.  [Define system specifications](#orgd026bc1)
        3.  [Design the software architecture](#orge6537eb)
    4.  [Development](#org3ef34a1)
        1.  [Misc](#orgd2c56e4)
        2.  [Physics simulation Itr 1](#orgd42617a)
        3.  [Review Itr 1](#orgd65aff9)
        4.  [Implement the input and output handling](#org2ececd9)



<a id="org4305d17"></a>

# PROJ Schedule <code>[1/4]</code>


<a id="orgb3e8b29"></a>

## TODO Development <code>[1/4]</code>


<a id="org1268ff7"></a>

### TODO Implement the input and output handling

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-06-27 Tue&gt;</span></span></p>

-   [ ] cli arguments (picocli)


<a id="org83656a9"></a>

### TODO Physics simulation Itr 2

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-07-11 Tue&gt;</span></span></p>


<a id="orged1520f"></a>

### TODO Review Itr 2

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-07-13 Thu&gt;</span></span></p>


<a id="orgaaf7960"></a>

## TODO Testing <code>[0/3]</code>


<a id="org5d89666"></a>

### TODO Unit Testing

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-07-09 Sun&gt;</span></span></p>

-   [X] Identify functions for testing
-   [ ] Develop boundary value tests
-   [ ] Develop equivalence class tests
-   [X] Develop decision table-based tests
-   [ ] Develop path tests
-   [ ] Develop data flow tests


<a id="org48157c9"></a>

### TODO Integration Testing

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-07-09 Sun&gt;</span></span></p>

-   [ ] Identify subset of units for integration testing
-   [ ] Develop and execute integration tests


<a id="org77e9b92"></a>

### TODO System Testing

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-07-09 Sun&gt;</span></span></p>

-   [X] Identify subset of use cases for system testing
-   [ ] Develop and execute system tests


<a id="org27f99d7"></a>

## TODO Docs & Submission <code>[0/3]</code>


<a id="orgfb0628f"></a>

### TODO Documentation

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-07-20 Thu&gt;</span></span></p>

-   [X] Create README.md file
-   [ ] Create TESTING.md file
-   [ ] Ensure code is commented


<a id="orge01d5c3"></a>

### TODO Review and Final Adjustments

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-07-25 Tue&gt;</span></span></p>

-   [ ] Review entire simulator and tests
-   [ ] Make necessary adjustments


<a id="org8ff456d"></a>

### TODO Final Submission

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-08-02 Wed&gt;</span></span></p>


<a id="orgbbd5ae0"></a>

# Completed


<a id="org11e0329"></a>

## DONE Set Up Development Environment

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-05-23 Tue&gt;</span></span></p>

-   [X] Install necessary software
-   [X] Setup GitHub repository


<a id="org45ae43d"></a>

## DONE Develop Initial Understanding

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-06-02 Fri&gt;</span></span></p>

-   [X] Understand the physics involved in the simulation
-   [X] Research on best practices for implementing physics in Java
-   [X] Research on best practices for java testing frameworks


<a id="org7b94f0c"></a>

### DONE Problem Spec readme

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-06-02 Fri&gt;</span></span></p>

1.  DONE Objectives

2.  DONE Functions

3.  DONE Requirements


<a id="orgcb4a562"></a>

## DONE Design <code>[0/0]</code>


<a id="org3783732"></a>

### DONE Initial Design

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-06-01 Thu&gt;</span></span></p>

-   [X] Understand the problem domain
-   [X] Research on Howitzers, their operation and factors affecting their projectiles
-   [X] Understand the physics formulas provided and how they apply to the problem


<a id="orgd026bc1"></a>

### DONE Define system specifications

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-06-06 Tue&gt;</span></span></p>

-   [X] Define the required inputs and expected outputs of the simulator
-   [X] Identify key variables of the system: barrel pose, projectile radius and mass, drag coefficient, initial speed, force, and gravity
-   [X] Discuss and agree on how these variables will be represented and manipulated in the simulator


<a id="orge6537eb"></a>

### DONE Design the software architecture

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-06-11 Sun&gt;</span></span></p>

-   [X] Identify key components/modules of the simulator
-   [X] Establish interfaces and interactions between the components
-   [X] Choose suitable data structures and algorithms for implementing the simulation
-   [X] Sketch out a flowchart or UML diagram of the proposed system for visualization


<a id="org3ef34a1"></a>

## DONE Development

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-06-18 Sun&gt;</span></span></p>


<a id="orgd2c56e4"></a>

### Misc

-   [X] Set up action to run tests on github
-   [X] Set up action to mirror repo to gitlab

-   [X] Set up the basic structure of the simulator
-   [X] Create the basic classes and functions as per the software architecture
-   [X] Set up a basic UI if necessary, depending on plan to represent the simulator


<a id="orgd42617a"></a>

### DONE Physics simulation Itr 1

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-06-27 Tue&gt;</span></span></p>

First iteration will include external force and drag in a unidirectional, time invariant vector space

-   [X] Translate the physics formulas into Java code, options:
    -   [X] hard coded kinematics
    -   [X] parse equations to function
-   [X] Implement the logic for simulating projectile movement
    -   [X] external force applied
    -   [X] drag force applied


<a id="orgd65aff9"></a>

### DONE Review Itr 1

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-06-27 Tue&gt;</span></span></p>

-   [X] Ensure that all key variables incorporated into the simulation correctly
-   [X] Ensure that errors in inputs handled gracefully
-   [X] Align on path forward for next iteration


<a id="org2ececd9"></a>

### DONE Implement the input and output handling

<p><span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE:</span> <span class="timestamp">&lt;2023-06-27 Tue&gt;</span></span></p>

-   [X] Develop the logic for users to input the variables for the simulation
    -   [X] json file parsing (gson)
-   [X] Implement the logic for displaying the output of the simulation
    -   Currently prints a tuple(x, y, z) coordinates of the projectile in the vector space

